export default function TermPage() {
  return (
    <div className="container mx-auto max-w-3xl py-8">
      <h1 className="text-3xl font-bold mb-4">이용약관</h1>
      <div className="prose max-w-none text-xs">
        <h2>제1장 총칙</h2>

        <h3>제1조(목적)</h3>
        <p>
          이 약관은 SYDE(이하 &quot;당 사이트&quot;라 함)에서 제공하는 모든 서비스(이하
          &quot;서비스&quot;라 함)의 이용과 관련하여 당 사이트와 이용자의 권리, 의무 및
          책임사항과 기타 제반 사항을 규정함을 목적으로 합니다.
        </p>

        <h3>제2조(약관의 명시와 개정)</h3>
        <ol>
          <li>
            당 사이트는 이 약관의 내용과 주소지, 관리자의 성명, 개인정보보호
            담당자의 성명, 연락처(전화, 팩스, 전자우편 주소 등) 등을 이용자가 알
            수 있도록 당 사이트의 초기 서비스화면(전면)에 게시합니다.
          </li>
          <li>
            당 사이트는 약관의 규제에 관한 법률, 전자거래기본법, 전자서명법,
            정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관련법을 위배하지
            않는 범위에서 이 약관을 개정할 수 있습니다.
          </li>
          <li>
            당 사이트가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여
            현행약관과 함께 당 사이트의 초기화면에 그 적용일자 7일 이전부터
            적용일자 전일까지 공지합니다.
          </li>
          <li>
            이 약관에 동의하는 것은 정기적으로 웹을 방문하여 약관의 변경사항을
            확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지
            못해 발생하는 이용자의 피해는 당 사이트에서 책임지지 않습니다.
          </li>
          <li>
            회원은 변경된 약관에 동의하지 않을 경우 회원 탈퇴(해지)를 요청할 수
            있으며, 변경된 약관의 효력 발생일로부터 7일 이후에도 거부의사를
            표시하지 아니 하고 서비스를 계속 사용할 경우 약관의 변경 사항에
            동의한 것으로 간주됩니다.
          </li>
          <li>
            본 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법,
            정보통신망 이용촉진 및 정보보호 등에 관한 법률 및 기타 관련 법령의
            규정에 의합니다.
          </li>
        </ol>

        <h3>제3조(용어의 정의)</h3>
        <ol>
          <li>
            본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
            <ol>
              <li>
                이용계약 : 서비스 이용과 관련하여 당 사이트와 이용자 간에
                체결하는 계약
              </li>
              <li>
                서비스 : &quot;당 사이트&quot;에서 제공되는 모든 서비스 및 관련 제반
                사항을 의미합니다.
              </li>
              <li>
                가입 : &quot;당 사이트&quot;가 제공하는 신청서 양식에 해당 정보를
                기입하고, 본 약관에 동의하여 서비스 이용계약을 완료시키는 행위
              </li>
              <li>
                이용자 : &quot;당 사이트&quot;에 접속하여 이 약관에 따라 &quot;당 사이트&quot;가
                제공하는 정보 및 기타 서비스를 제공받는 자
              </li>
              <li>
                회원 : &quot;당 사이트&quot;와 이용계약을 체결하고 &quot;이용자 번호”를 부여
                받은 &quot;이용자&quot;로서 &quot;당 사이트&quot;의 정보를 지속적으로 제공받으며 &quot;당
                사이트&quot;가 제공하는 서비스를 지속적으로 이용할 수 있는 자
              </li>
              <li>
                이용자번호(ID) : 이용고객의 식별과 이용자가 서비스 이용을 위하여
                이용자가 정하고 당 사이트가 승인하는 문자와 숫자의 조합
              </li>
              <li>
                비밀번호(PASSWORD) : &quot;회원&quot;이 부여받은 &quot;이용자번호&quot;와 일치되는
                &quot;회원&quot;임을 확인하고 비밀보호를 위해 &quot;회원&quot; 자신이 정한 문자 또는
                숫자의 조합
              </li>
            </ol>
          </li>
          <li>
            이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 온라인
            디지털콘텐츠산업 발전법, 전자상거래 등에서의 소비자보호에 관한 법률,
            약관의 규제에 관한 법률, 문화체육관광부장관이 정하는
            디지털콘텐츠이용자보호지침, 기타 관계법령 또는 상관례에 따릅니다.
          </li>
        </ol>

        <h2>제2장 회원의 가입 및 관리</h2>

        <h3>제4조(회원 가입)</h3>
        <ol>
          <li>
            회원 가입을 희망하는 &quot;이용자&quot;는 &quot;당 사이트&quot;가 정한 가입 양식에 따라
            회원정보를 기입하고 &quot;동의&quot; 버튼을 누르는 방법으로 회원 가입을 신청한
            후 &quot;당 사이트&quot;가 이러한 신청에 대하여 승낙함으로써 체결됩니다.
          </li>
          <li>
            회원가입신청서에는 다음 사항을 기재해야 합니다. 1호, 2호, 3호의
            사항은 필수사항이며, 그 외의 사항은 선택사항입니다.
            <ol>
              <li>&quot;회원&quot;의 성명 또는 인터넷상 개인식별번호</li>
              <li>&quot;아이디&quot;와 &quot;비밀번호&quot;</li>
              <li>전자우편주소</li>
              <li>&quot;이용자&quot; 프로필 정보</li>
              <li>&quot;이용자&quot; 취향 정보</li>
              <li>기타 &quot;당 사이트&quot;가 필요하다고 인정하는 사항</li>
            </ol>
          </li>
          <li>
            &quot;당 사이트&quot;는 제1항과 같이 회원으로 가입을 신청한 자가 다음 각 호에
            해당하지 않는 한 신청한 자를 회원으로 등록합니다.
            <ol>
              <li>등록 내용에 허위, 기재누락, 오기가 있는 경우</li>
              <li>
                14세 미만의 아동이 개인정보제공에 대한 동의를 부모 등
                법정대리인으로부터 받지 않은 경우
              </li>
              <li>
                제9조 제2항에 해당하는 회원 자격 제한 및 정지, 상실을 한 경험이
                있었던 경우
              </li>
              <li>
                제13조 제2항에 의하여 회사가 계약을 해지했던 회원이 다시 회원
                신청을 하는 경우
              </li>
              <li>
                기타 회원으로 등록하는 것이 당 사이트의 서비스 운영 및 기술상
                현저히 지장이 있다고 판단되거나 관련법령 등을 기준으로 하여
                명백하게 사회질서 및 미풍양속에 반할 우려가 있음을 인정하는 경우
              </li>
            </ol>
          </li>
          <li>
            &quot;당 사이트&quot;는 아래 각 호의 1에 해당하는 경우에는 회원등록의 승낙을
            유보할 수 있습니다.
            <ol>
              <li>제공서비스 설비용량에 현실적인 여유가 없는 경우</li>
              <li>
                서비스를 제공하기에는 기술적으로 문제가 있다고 판단되는 경우
              </li>
              <li>기타 회사가 재정적, 기술적으로 필요하다고 인정하는 경우</li>
            </ol>
          </li>
          <li>
            회원가입계약의 성립시기는 당 사이트의 승낙이 가입신청자에게 도달한
            시점으로 합니다.
          </li>
          <li>
            회원은 제1항의 회원정보 기재 내용에 변경이 발생한 경우, 즉시
            변경사항을 정정하여 기재하여야 합니다.
          </li>
          <li>
            외부 서비스와의 연동을 통해 회원가입을 신청할 경우, 본 약관과
            개인정보처리방침, 서비스 제공을 위해 당 사이트의 가입신청자의 외부
            서비스 계정 정보 접근 및 활용에 &quot;동의&quot; 또는 &quot;확인&quot; 버튼을 누르면 당
            사이트가 승낙함으로써 가입신청자에게 도달한 시점으로 가입됩니다.
          </li>
        </ol>

        <h3>제5조(미성년자의 회원가입에 관한 특칙)</h3>
        <ol>
          <li>
            만 14세 미만의 &quot;이용자&quot;는 개인정보의 수집 및 이용목적에 대하여
            충분히 숙지하고 부모 등 법정대리인의 동의를 얻은 후에 회원가입을
            신청하고 본인의 개인정보를 제공하여야 합니다.
          </li>
          <li>
            당 사이트는 부모 등 법정대리인의 동의에 대한 확인절차를 거치지 않은
            14세 미만 이용자에 대하여는 가입을 취소 또는 불허합니다.
          </li>
          <li>
            만 14세 미만 &quot;이용자&quot;의 부모 등 법정대리인은 아동에 대한 개인정보의
            열람, 정정, 갱신을 요청하거나 회원가입에 대한 동의를 철회할 수
            있으며, 이러한 경우에 &quot;당 사이트&quot;는 지체 없이 필요한 조치를 취해야
            합니다.
          </li>
        </ol>

        <h3>제6조(회원정보의 변경)</h3>
        <ol>
          <li>
            &quot;회원&quot;은 개인정보관리화면을 통하여 언제든지 자신의 개인정보를
            열람하고 수정할 수 있습니다.
          </li>
          <li>
            &quot;회원&quot;은 회원가입신청 시 기재한 사항이 변경되었을 경우 온라인으로
            수정을 하거나 전자우편 기타 방법으로 &quot;당 사이트&quot;에 대하여 그
            변경사항을 알려야 합니다.
          </li>
          <li>
            제2항의 변경사항을 &quot;당 사이트&quot;에 알리지 않아 발생한 불이익에 대하여
            &quot;당 사이트&quot;는 책임지지 않습니다.
          </li>
        </ol>

        <h3>제7조(&quot;회원&quot;의 &quot;아이디&quot; 및 &quot;비밀번호&quot;의 관리에 대한 의무)</h3>
        <ol>
          <li>
            &quot;회원&quot;의 &quot;아이디&quot;와 &quot;비밀번호&quot;에 관한 관리책임은 &quot;회원&quot;에게 있으며,
            이를 제3자가 이용하도록 하여서는 안 됩니다.
          </li>
          <li>
            &quot;회원&quot;은 &quot;아이디&quot; 및 &quot;비밀번호&quot;가 도용되거나 제3자에 의해 사용되고
            있음을 인지한 경우에는 이를 즉시 &quot;당 사이트&quot;에 통지하고 &quot;당
            사이트&quot;의 안내에 따라야 합니다.
          </li>
          <li>
            제2항의 경우에 해당 &quot;회원&quot;이 &quot;당 사이트&quot;에 그 사실을 통지하지
            않거나, 통지한 경우에도 &quot;당 사이트&quot;의 안내에 따르지 않아 발생한
            불이익에 대하여 &quot;당 사이트&quot;는 책임지지 않습니다.
          </li>
        </ol>

        <h3>제8조(&quot;회원&quot;에 대한 통지)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;가 &quot;회원&quot;에 대한 통지를 하는 경우 &quot;회원&quot;이 지정한
            전자우편주소로 할 수 있습니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 &quot;회원&quot; 전체에 대한 통지의 경우 7일 이상 &quot;당 사이트&quot;의
            게시판에 게시함으로써 제1항의 통지에 갈음할 수 있습니다. 다만,
            &quot;회원&quot; 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는
            제1항의 통지를 합니다.
          </li>
        </ol>

        <h3>제9조(회원탈퇴 및 자격 상실 등)</h3>
        <ol>
          <li>
            &quot;회원&quot;은 &quot;당 사이트&quot;에 언제든지 탈퇴를 요청할 수 있으며 &quot;당
            사이트&quot;는 즉시 회원탈퇴를 처리합니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 각 호의 1에 해당하는 사유가 발생한 경우에는 회원의
            서비스 이용을 제한하거나 중지시킬 수 있습니다.
            <ol>
              <li>회원이 회사 서비스의 운영을 고의∙과실로 방해하는 경우</li>
              <li>회원이 제13조(이용자의 의무)를 위반한 경우</li>
              <li>서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우</li>
              <li>
                전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를
                중지했을 경우
              </li>
              <li>
                국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로
                서비스 이용에 지장이 있는 때
              </li>
              <li>
                기타 중대한 사유로 인하여 &quot;당 사이트&quot;가 서비스 제공을 지속하는
                것이 부적당하다고 인정하는 경우
              </li>
            </ol>
          </li>
          <li>
            &quot;회원&quot;이 다음 각호의 사유에 해당하는 경우, &quot;당 사이트&quot;는 회원자격을
            제한 및 정지시킬 수 있습니다.
            <ol>
              <li>가입신청 시에 허위내용을 등록한 경우</li>
              <li>
                &quot;당 사이트&quot;의 서비스이용대금, 기타 &quot;당 사이트&quot;의 서비스이용에
                관련하여 회원이 부담하는 채무를 기일에 이행하지 않는 경우
              </li>
              <li>
                다른 사람의 &quot;당 사이트&quot;의 서비스이용을 방해하거나 그 정보를
                도용하는 등 전자상거래 질서를 위협하는 경우
              </li>
              <li>
                &quot;당 사이트&quot;를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에
                반하는 행위를 하는 경우
              </li>
            </ol>
          </li>
          <li>
            &quot;당 사이트&quot;가 회원자격을 제한·정지시킨 후, 동일한 행위가 2회 이상
            반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 &quot;당
            사이트&quot;는 회원자격을 상실 시킬 수 있습니다.
          </li>
          <li>
            &quot;당 사이트&quot;가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다.
            이 경우 &quot;회원&quot;에게 이를 통지하고, 회원등록 말소 전에 최소한 30일
            이상의 기간을 정하여 소명할 기회를 부여합니다.
          </li>
        </ol>

        <h3>제10조(수신확인통지·이용신청 변경 및 취소)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;는 &quot;이용자&quot;의 이용신청이 있는 경우 &quot;이용자&quot;에게
            수신확인통지를 합니다.
          </li>
          <li>
            회원이 이용계약 해지를 한 경우 회원 &quot;이용자번호&quot;에 기록된
            보관자료(스크랩, 알림 등)는 삭제됩니다.
          </li>
          <li>
            수신확인통지를 받은 &quot;이용자&quot;는 의사표시의 불일치 등이 있는 경우에는
            수신확인통지를 받은 후 즉시 이용신청 변경 및 취소를 요청할 수 있고,
            &quot;당 사이트&quot;는 서비스제공 전에 &quot;이용자&quot;의 요청이 있는 경우에는 지체
            없이 그 요청에 따라 처리하여야 합니다. 다만, 이미 대금을 지불한
            경우에는 청약철회 등에 관한 제27조의 규정에 따릅니다.
          </li>
        </ol>

        <h2>제3장 서비스의 이용</h2>

        <h3>제11조 (서비스 이용 계약)</h3>
        <ol>
          <li>
            &quot;이용자&quot;는 &quot;당 사이트&quot;가 제공하는 다음 또는 이와 유사한 절차에
            의하여 이용신청을 합니다. &quot;당 사이트&quot;는 계약 체결 전에 각 호의
            사항에 관하여 &quot;이용자&quot;가 정확하게 이해하고 실수 또는 착오 없이
            거래할 수 있도록 정보를 제공합니다.
            <ol>
              <li>&quot;콘텐츠&quot; 목록의 열람 및 선택</li>
              <li>
                성명, 주소, 전화번호(또는 이동전화번호), 전자우편주소 등의 입력
              </li>
              <li>
                약관내용, 청약철회가 불가능한 &quot;서비스&quot;에 대해 &quot;당 사이트&quot;가 취한
                조치와 관련한 내용에 대한 확인
              </li>
              <li>
                이 약관에 동의하고 위 제3호의 사항을 확인하거나 거부하는
                표시(예, 마우스 클릭)
              </li>
              <li>
                &quot;서비스&quot;의 이용신청에 관한 확인 또는 &quot;당 사이트&quot;의 확인에 대한
                동의
              </li>
            </ol>
          </li>
        </ol>

        <h3>제12조(&quot;당 사이트&quot;의 의무)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;는 법령과 이 약관이 정하는 권리의 행사와 의무의 이행을
            신의를 바탕으로 성실하게 하여야 합니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 서비스의 제공과 관련하여 알게 된 회원의 개인정보를
            본인의 승낙 없이 제3자에게 누설, 배포하지 않고, 이를 보호하기 위하여
            노력하며, &quot;이용자&quot;가 안전하게 &quot;서비스&quot;를 이용할 수 있도록
            개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며
            개인정보보호정책을 공시하고 준수합니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 &quot;회원&quot;이 수신 동의를 하지 않은 광고성 전자우편, SMS
            문자메시지 등을 발송하지 아니합니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 서비스이용과 관련하여 &quot;이용자&quot;로부터 제기된 의견이나
            불만이 정당하다고 인정할 경우에는 이를 지체없이 처리합니다. 이용자가
            제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편
            등을 통하여 그 처리과정 및 결과를 전달합니다.
          </li>
        </ol>

        <h3>제13조(&quot;이용자&quot;의 의무)</h3>
        <ol>
          <li>
            &quot;이용자&quot;는 다음 행위를 하여서는 안 됩니다.
            <ol>
              <li>신청 또는 변경 시 허위내용의 기재</li>
              <li>
                다른 회원의 ID 및 비밀번호를 도용하여 부당하게 서비스를 이용하는
                행위
              </li>
              <li>&quot;당 사이트&quot;에 게시된 정보의 변경</li>
              <li>
                &quot;당 사이트&quot;가 금지한 정보(컴퓨터 프로그램 등)의 송신 또는 게시
              </li>
              <li>
                &quot;당 사이트&quot;와 기타 제3자의 저작권 등 지적재산권에 대한 침해
              </li>
              <li>
                &quot;당 사이트&quot; 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는
                행위
              </li>
              <li>
                어그로(Aggravation), 분탕질, 욕설, 글 도배 등 다른 회원의 서비스
                이용을 방해하는 행위
              </li>
              <li>
                스토킹(stalking), 허위 또는 악의적 신고 남용 등 다른 이용자를
                괴롭히는 행위
              </li>
              <li>
                외설 또는 폭력적인 말이나 글, 화상, 음향, 기타 공서양속에 반하는
                정보를 &quot;당 사이트&quot;의 사이트에 공개 또는 게시하는 행위
              </li>
              <li>
                청소년보호법에서 규정하는 청소년유해매체물을 게시하는 행위
              </li>
              <li>재물을 걸고 도박하거나 사행행위를 하는 행위</li>
              <li>
                윤락행위를 알선하거나 음행을 매개하는 내용의 정보를 유통시키는
                행위
              </li>
              <li>
                정크(junk), 스팸(spam), 행운의 편지(chain letters), 피라미드
                조직에 가입할 것을 권유하는 행위 , 외설 또는 폭력적인
                메시지•화상•음성 등이 담긴 글이나 이미지를 보내거나 기타
                공서양속에 반하는 정보를 공개 또는 게시하는 행위
              </li>
              <li>
                당 사이트의 사전 허락 없이 자동화된 수단(예:매크로 프로그램,
                스파이더, 스크래퍼 등)을 이용하여 회원으로 가입을 시도 또는
                가입하거나, 로그인을 시도 또는 로그인을 하거나, 서비스 상에
                게시물을 게재하거나 서비스에 게재된 회원의 아이디(ID), 게시물
                등을 수집하는 등 서비스 제공 취지에 부합하지 않은 방식으로
                서비스를 이용하는 일체의 행위
              </li>
              <li>
                서비스에 포함된 소프트웨어 및 데이터를 역 설계, 소스코드 추출
                시도, 복제, 분해, 모방, 기타 변형하는 등의 행위
              </li>
              <li>
                서비스에 게시된 정보를 변경하거나 서비스를 이용하여 얻은 정보를
                회사의 사전 승낙 없이 영리 또는 비영리의 목적으로 복제, 출판,
                방송 등에 사용하거나 제3자에게 제공하는 행위
              </li>
              <li>
                회사가 제공하는 서비스를 이용하여 제3자에게 홍보할 기회를 제공
                하거나 제3자의 홍보를 대행하는 등의 방법으로 금전을 수수하거나
                서비스를 이용할 권리를 양도하고 이를 대가로 금전을 수수하는 행위
              </li>
              <li>
                기타 불법적이거나 부당한 행위 또는 현행 법령, 회사가 제공하는
                서비스에 정한 약관 기타 서비스 이용에 관한 규정을 위반하는 행위
              </li>
            </ol>
          </li>
          <li>
            &quot;당 사이트&quot;는 회원이 제1항의 행위를 하는 경우 해당 게시물 등을 삭제
            또는 임시삭제할 수 있고 서비스의 이용을 제한하거나 일방적으로 본
            계약을 해지할 수 있습니다.
          </li>
          <li>
            &quot;이용자&quot;는 관계법령, 이 약관의 규정, 이용안내 및 &quot;서비스&quot;와 관련하여
            공지한 주의사항, &quot;당 사이트&quot;가 통지하는 사항 등을 준수하여야 하며,
            기타 &quot;당 사이트&quot;의 업무에 방해되는 행위를 하여서는 안 됩니다.
          </li>
          <li>
            &quot;당 사이트&quot;가 제공하는 서비스 중 관련 법령 등의 규정에 의하여
            성인인증이 필요한 경우 회원은 해당 서비스를 이용하기 위하여 회사가
            제공하는 방법에 따라 실명정보를 회사에 제공하여야 합니다. 3자와
            공유하는 등 관련 법령을 준수합니다.
          </li>
        </ol>

        <h3>제14조(양도금지)</h3>
        <p>
          회원의 서비스 받을 권리는 이를 양도 내지 증여하거나 질권의 목적으로
          사용할 수 없습니다.
        </p>

        <h3>제15조(정보의 제공 및 광고의 게재)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;는 &quot;이용자&quot;가 서비스 이용 중 필요하다고 인정되는 다양한
            정보를 공지사항이나 전자우편 등의 방법으로 &quot;회원&quot;에게 제공할 수
            있습니다. 다만, &quot;회원&quot;은 언제든지 전자우편 등을 통하여 수신 거절을
            할 수 있습니다.
          </li>
          <li>
            제1항의 정보를 전화 및 모사전송기기에 의하여 전송하려고 하는
            경우에는 &quot;회원&quot;의 사전 동의를 받아서 전송합니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 서비스 제공과 관련하여 서비스 화면, 홈페이지, 전자우편
            등에 광고를 게재할 수 있습니다. 광고가 게재된 전자우편 등을 수신한
            &quot;회원&quot;은 수신거절을 &quot;당 사이트&quot;에게 할 수 있습니다.
          </li>
        </ol>

        <h3>
          제16조(게시물 등 작성에 따른 책임과 당 사이트의 정보 수정•삭제 권한)
        </h3>
        <ol>
          <li>
            &quot;당 사이트&quot;는 게시판에 정보통신망이용촉진 및 정보보호 등에 관한
            법률을 위반한 청소년유해매체물이 게시되어 있는 경우에는 이를 지체
            없이 삭제합니다. 다만, 19세 이상의 &quot;이용자&quot;만 이용할 수 있는
            게시판은 예외로 합니다.
          </li>
          <li>
            &quot;당 사이트&quot;가 운영하는 게시판 등에 게시된 정보로 인하여 법률상
            이익이 침해된 자는 &quot;당 사이트&quot;에게 당해 정보의 삭제 또는 반박내용의
            게재를 요청할 수 있습니다. 이 경우 &quot;당 사이트&quot;는 지체 없이 필요한
            조치를 취하고 이를 즉시 신청인에게 통지합니다.
          </li>
          <li>
            개인회원은 게시물 등을 사실에 기반하여 진실하고 성실하게 작성하여야
            하며, 만일 게시물 등의 내용이 사실이 아니거나 부정확하게 작성되어
            발생하는 모든 책임은 전적으로 당해 게시물 등을 등록한 개인회원에게
            있습니다. 당 사이트는 개인회원이 작성한 게시물 등의 정확성 및
            진실성을 보증하지 않으며, 게시물에 대한 일체의 책임을 부담하지
            않습니다.
          </li>
          <li>
            모든 게시물 등의 작성 및 관리는 당해 게시물 등을 작성한 개인회원
            본인이 하는 것이 원칙입니다. 개인회원의 사정상 위탁 또는 대행관리를
            하더라도 게시물 등 작성의 책임은 회원에게 있고, 개인회원은
            주기적으로 자신의 자료를 확인하여 항상 정확성을 유지하도록 관리해야
            합니다.
          </li>
          <li>
            당 사이트는 회원이 작성한 게시물이 다음 각 호에 해당한다고 판단되는
            경우, 이를 삭제하거나 게시를 거부할 수 있습니다.
            <ol>
              <li>음란 게시물</li>
              <li>청소년에게 유해한 게시물</li>
              <li>차별•갈등을 조장하는 게시물</li>
              <li>도배 광고 또는 홍보 스팸성 게시물</li>
              <li>계정의 양도나 거래를 내용으로 하는 게시물</li>
              <li>타인을 사칭하는 게시물</li>
              <li>기타 법령에 위반되거나 그에 준하는 게시물</li>
              <li>
                회원이 등록한 게시물 등으로 인해 제3자로부터 허위사실 또는
                명예훼손 등을 이유로 삭제 요청이 접수된 경우 또는 회원이 등록한
                게시물 등으로 인하여 사이트 등의 원활한 운영에 영향을 미친다고
                판단되는 경우, 당 사이트는 회원의 해당 게시물 등을 직권으로
                삭제할 수 있으며, 회원에게 해당 게시물 등의 삭제 사실 및 사유를
                사후 통지할 수 있습니다.
              </li>
            </ol>
          </li>
        </ol>

        <h3>제17조(저작권 등의 귀속)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;가 작성한 저작물에 대한 저작권 기타 지적재산권은 &quot;당
            사이트&quot;에 귀속합니다.
          </li>
          <li>
            &quot;당 사이트&quot;가 제공하는 서비스 중 제휴계약에 의해 제공되는 저작물에
            대한 저작권 기타 지적재산권은 해당 제공업체에 귀속합니다.
          </li>
          <li>
            &quot;회원&quot;이 작성한 게시물 등은 &quot;당 사이트&quot;가 운영하는 인터넷 사이트 및
            모바일 어플리케이션, 제휴사업자를 통해 노출될 수 있으며, 검색결과
            내지 관련 프로모션 등에도 노출될 수 있습니다. 해당 노출을 위해
            필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다.
            이 경우, 회사는 저작권법 규정을 준수하며, 회원은 언제든지 고객센터
            또는 각 서비스 내 관리기능을 통해 해당 게시물 등에 대해 삭제, 비공개
            등의 조치를 취할 수 있습니다.
          </li>
          <li>
            회원이 서비스 내에 게시한 게시물의 저작권은 게시한 회원에게
            귀속됩니다. 단, &quot;당 사이트&quot;는 서비스의 운영, 전시, 전송, 배포,
            홍보의 목적으로 회원의 별도의 허락 없이 무상으로 저작권법에 규정하는
            공정한 관행에 합치되게 합리적인 범위 내에서 다음과 같이 회원이
            등록한 게시물을 사용할 수 있습니다.
            <ol>
              <li>
                서비스 내에서 회원 게시물의 복제, 수정, 개조, 전시, 전송, 배포
                및 저작물성을 해치지 않는 범위 내에서의 편집 저작물 작성
              </li>
              <li>
                미디어, 통신사 등 서비스 제휴 파트너에게 회원의 게시물 내용을
                제공, 전시 혹은 홍보하게 하는 것. 단, 이 경우 회사는 별도의 동의
                없이 회원의 이용자번호(ID)외에 회원의 개인정보를 제공하지
                않습니다.
              </li>
              <li>
                당 사이트는 전항 이외의 방법으로 회원의 게시물을 이용하고자 하는
                경우, 전화, 팩스, 전자우편 등의 방법을 통해 사전에 회원의 동의를
                얻어야 합니다.
              </li>
              <li>
                &quot;이용자&quot;는 &quot;당 사이트&quot;가 제공하는 서비스를 이용함으로써 얻은
                정보 중 &quot;당 사이트&quot; 또는 제공업체에 지적재산권이 귀속된 정보를
                &quot;당 사이트&quot; 또는 제공업체의 사전승낙 없이 복제, 전송, 출판,
                배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게
                이용하게 하여서는 안 됩니다.
              </li>
            </ol>
          </li>
        </ol>

        <h3>제18조(개인정보보호)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;는 제4조 제2항의 신청서기재사항 이외에 &quot;이용자&quot;의 서비스
            이용에 필요한 최소한의 정보를 수집할 수 있습니다. 이를 위해 &quot;당
            사이트&quot;가 문의한 사항에 관해 &quot;이용자&quot;는 진실한 내용을 성실하게
            고지하여야 합니다.
          </li>
          <li>
            &quot;당 사이트&quot;가 &quot;이용자&quot;의 개인 식별이 가능한 &quot;개인정보&quot;를 수집하는
            때에는 당해 &quot;이용자&quot;의 동의를 받습니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 &quot;이용자&quot;가 이용신청 등에서 제공한 정보와 제1항에
            의하여 수집한 정보를 당해 &quot;이용자&quot;의 동의 없이 목적 외로 이용하거나
            제3자에게 제공할 수 없으며, 이를 위반한 경우에 모든 책임은 &quot;당
            사이트&quot;가 집니다. 다만, 다음의 경우에는 예외로 합니다.
            <ol>
              <li>
                통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정
                개인을 식별할 수 없는 형태로 제공하는 경우
              </li>
              <li>&quot;서비스&quot; 제공에 따른 요금정산을 위하여 필요한 경우</li>
              <li>도용방지를 위하여 본인확인에 필요한 경우</li>
              <li>
                약관의 규정 또는 법령에 의하여 필요한 불가피한 사유가 있는 경우
              </li>
            </ol>
          </li>
          <li>
            &quot;당 사이트&quot;가 제2항과 제3항에 의해 &quot;이용자&quot;의 동의를 받아야 하는
            경우에는 &quot;개인정보&quot;관리책임자의 신원(소속, 성명 및 전화번호 기타
            연락처), 정보의 수집목적 및 이용목적, 제3자에 대한
            정보제공관련사항(제공받는 자, 제공목적 및 제공할 정보의 내용)등에
            관하여 정보통신망이용촉진 및 정보보호 등에 관한 법률 제22조 제2항이
            규정한 사항을 명시하고 고지하여야 합니다.
          </li>
          <li>&quot;이용자&quot;는 언제든지 제3항의 동의를 임의로 철회할 수 있습니다.</li>
          <li>
            &quot;이용자&quot;는 언제든지 &quot;당 사이트&quot;가 가지고 있는 자신의 &quot;개인정보&quot;에
            대해 열람 및 오류의 정정을 요구할 수 있으며, &quot;당 사이트&quot;는 이에 대해
            지체 없이 필요한 조치를 취할 의무를 집니다. &quot;이용자&quot;가 오류의 정정을
            요구한 경우에는 &quot;당 사이트&quot;는 그 오류를 정정할 때까지 당해
            &quot;개인정보&quot;를 이용하지 않습니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 개인정보보호를 위하여 관리자를 한정하여 그 수를
            최소화하며, 신용카드, 은행계좌 등을 포함한 &quot;이용자&quot;의 &quot;개인정보&quot;의
            분실, 도난, 유출, 변조 등으로 인한 &quot;이용자&quot;의 손해에 대하여 책임을
            집니다.
          </li>
          <li>
            &quot;당 사이트&quot; 또는 그로부터 &quot;개인정보&quot;를 제공받은 자는 &quot;이용자&quot;가
            동의한 범위 내에서 &quot;개인정보&quot;를 사용할 수 있으며, 목적이 달성된
            경우에는 당해 &quot;개인정보&quot;를 지체 없이 파기합니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 정보통신망이용촉진 및 정보보호에 관한 법률 등 관계
            법령이 정하는 바에 따라 &quot;이용자&quot;의 &quot;개인정보&quot;를 보호하기 위해
            노력합니다. &quot;개인정보&quot;의 보호 및 사용에 대해서는 관련법령 및 &quot;당
            사이트&quot;의 개인정보보호정책이 적용됩니다.
          </li>
        </ol>

        <h3>제19조(서비스의 제공 및 중단)</h3>
        <ol>
          <li>서비스는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.</li>
          <li>
            &quot;당 사이트&quot;는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장,
            통신두절 또는 운영상 상당한 이유가 있는 경우 서비스의 제공을
            일시적으로 중단할 수 있습니다. 이 경우 &quot;당 사이트&quot;는 제8조[&quot;회원&quot;에
            대한 통지]에 정한 방법으로 &quot;이용자&quot;에게 통지합니다. 다만, &quot;당
            사이트&quot;가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에
            통지할 수 있습니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 상당한 이유 없이 서비스의 제공이 일시적으로 중단됨으로
            인하여 &quot;이용자&quot;가 입은 손해에 대하여 배상합니다. 다만, &quot;당 사이트&quot;가
            고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 서비스의 제공에 필요한 경우 정기점검을 실시할 수
            있으며, 정기점검시간은 서비스제공화면에 공지한 바에 따릅니다.
          </li>
        </ol>

        <h3>제20조(서비스의 변경)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라
            제공하고 있는 서비스를 변경할 수 있습니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 서비스의 내용, 이용방법, 이용시간을 변경할 경우에
            변경사유, 변경될 서비스의 내용 및 제공일자 등을 그 변경 전 7일 이상
            해당 서비스 초기화면에 게시합니다.
          </li>
          <li>
            제2항의 경우에 변경된 내용이 중대하거나 &quot;이용자&quot;에게 불리한 경우에는
            &quot;당 사이트&quot;가 해당 서비스를 제공받는 &quot;이용자&quot;에게 제8조[&quot;회원&quot;에
            대한 통지]에 정한 방법으로 통지하고 동의를 받습니다. 이때, &quot;당
            사이트&quot;는 동의를 거절한 &quot;이용자&quot;에 대하여는 변경전 서비스를
            제공합니다. 다만, 그러한 서비스 제공이 불가능할 경우 계약을 해지할
            수 있습니다.
          </li>
        </ol>

        <h3>제21조(&quot;이용자&quot;의 계약해제·해지)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;와 &quot;서비스&quot;의 이용에 관한 계약을 체결한 &quot;이용자&quot;는
            수신확인의 통지를 받은 날로부터 7일 이내에는 청약의 철회를 할 수
            있습니다. 다만, &quot;당 사이트&quot;가 다음 각 호중 하나의 조치를 취한
            경우에는 &quot;이용자&quot;의 청약철회권이 제한될 수 있습니다.
            <ol>
              <li>
                청약의 철회가 불가능한 &quot;서비스&quot;에 대한 사실을 표시사항에 포함한
                경우
              </li>
              <li>시용상품을 제공한 경우</li>
              <li>한시적 또는 일부이용 등의 방법을 제공한 경우</li>
            </ol>
          </li>
          <li>
            &quot;이용자&quot;는 다음 각 호의 사유가 있을 때에는 당해 &quot;서비스&quot;를 공급받은
            날로부터 3월 이내 또는 그 사실을 안 날 또는 알 수 있었던 날부터 30일
            이내에 서비스 이용계약을 해제·해지할 수 있습니다.
            <ol>
              <li>이용계약에서 약정한 &quot;서비스&quot;가 제공되지 않는 경우</li>
              <li>
                제공되는 &quot;서비스&quot;가 표시·광고 등과 상이하거나 현저한 차이가 있는
                경우
              </li>
              <li>
                기타 &quot;서비스&quot;의 결함으로 정상적인 이용이 현저히 불가능한 경우
              </li>
            </ol>
          </li>
          <li>
            제1항의 청약철회와 제2항의 계약해제·해지는 &quot;이용자&quot;가 전화, 전자우편
            또는 모사전송으로 &quot;당 사이트&quot;에 그 의사를 표시한 때에 효력이
            발생합니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 제3항에 따라 &quot;이용자&quot;가 표시한 청약철회 또는
            계약해제·해지의 의사표시를 수신한 후 지체 없이 이러한 사실을
            &quot;이용자&quot;에게 회신합니다.
          </li>
          <li>
            &quot;이용자&quot;는 제2항의 사유로 계약해제·해지의 의사표시를 하기 전에
            상당한 기간을 정하여 완전한 서비스 이용의 하자에 대한 치유를 요구할
            수 있습니다.
          </li>
        </ol>

        <h3>제22조(당 사이트의 계약해제·해지 및 이용제한)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;는 &quot;이용자&quot;가 제9조 제2항에서 정한 행위를 하였을 경우
            사전통지 없이 계약을 해제·해지하거나 또는 기간을 정하여 서비스이용을
            제한할 수 있습니다.
          </li>
          <li>
            제1항의 해제·해지는 &quot;당 사이트&quot;가 자신이 정한 통지방법에 따라
            &quot;이용자&quot;에게 그 의사를 표시한 때에 효력이 발생합니다.
          </li>
          <li>
            &quot;당 사이트&quot;의 해제·해지 및 이용제한에 대하여 &quot;이용자&quot;는 &quot;당
            사이트&quot;가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가
            정당하다고 &quot;당 사이트&quot;가 인정하는 경우, &quot;당 사이트&quot;는 즉시 서비스의
            이용을 재개합니다.
          </li>
        </ol>

        <h3>제23조(당 사이트의 계약해제·해지의 효과)</h3>
        <p>
          &quot;이용자&quot;의 귀책사유에 따른 이용계약의 해제·해지의 효과는 제21조를
          준용합니다.
        </p>

        <h2>제4장 오픈소스 이용</h2>

        <h3>제24조(오픈소스 라이선스)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;에서 제공하는 오픈소스에 관한 라이선스는 자유 소프트웨어
            재단의 GPLv2(또는 그 이상의 버전)를 따릅니다. 다음 링크에서 라이센스
            본문을 읽을 수 있습니다.
            <a
              href="https://www.gnu.org/licenses/old-licenses/gpl-2.0.en.html"
              target="_blank"
              rel="noopener noreferrer"
            >
              https://www.gnu.org/licenses/old-licenses/gpl-2.0.en.html
            </a>
          </li>
          <li>
            &quot;당 사이트&quot;에서 제공하는 &quot;오픈소스&quot;는 노코드라는 수단의 특성상 특정
            노코드 서비스의 컴포넌트, 모듈, 플러그인 또는 템플릿 등과 같은 파생
            작업물을 포함하며, 제1조의 GPL라이선스를 상속합니다. &quot;당 사이트&quot;와
            동일하게 GPL라이선스를 따르는 wordpress.org의 경우 테마와
            모듈(플러그인을 뜻하는 단어)에 적용하고 있다는 점에서 파생
            작업물에도 GPL라이선스를 부여할 수 있습니다.
          </li>
          <li>
            라이선스에 동의하지 않는 경우 오픈소스를 이용하실 수 없으며,
            무단으로 이용하여 생긴 문제에 대해 &quot;당 사이트&quot;와 &quot;오픈소스 빌더&quot;는
            책임에서 배제됩니다.
          </li>
        </ol>

        <h3>제25조(오픈소스 이용 계약)</h3>
        <ol>
          <li>
            &quot;오픈소스&quot;의 저작권은 기본적으로 &quot;오픈소스&quot;를 제작하고 공유하는
            &quot;오픈소스 빌더&quot;에게 있습니다.
          </li>
          <li>
            &quot;당 사이트&quot;에서 &quot;오픈소스 빌더&quot;로서 &quot;오픈소스&quot;를 공유하기 위해서는
            제1조의 &quot;오픈소스 라이선스&quot;를 따라야 하며, &quot;오픈소스 빌더&quot; 계약에
            동의하는 경우 이 조항에 동의한 것으로 간주합니다.
          </li>
          <li>
            &quot;오픈소스&quot;를 이용하는 &quot;이용자&quot;는 반드시 이용 신청을 통해야 하며,
            신청을 완료하는 경우 &quot;오픈소스 라이선스&quot;에 동의한 것으로 간주합니다.
          </li>
          <li>
            &quot;이용자&quot;는 &quot;당 사이트&quot;가 제공하는 다음 또는 이와 유사한 절차에
            의하여 &quot;오픈소스&quot; 이용신청을 합니다. &quot;당 사이트&quot;는 계약 체결 전에 각
            호의 사항에 관하여 &quot;이용자&quot;가 정확하게 이해하고 실수 또는 착오 없이
            거래할 수 있도록 정보를 제공합니다.
            <ol>
              <li>&quot;오픈소스&quot; 목록의 열람 및 선택</li>
              <li>
                &quot;오픈소스&quot; 이용에 따른 &quot;오픈소스 라이선스&quot; 내용, 청약철회가
                불가능한 &quot;서비스&quot;에 대해 &quot;당 사이트&quot;가 취한 조치와 관련한 내용에
                대한 확인
              </li>
              <li>
                이 약관에 동의하고 위 제3호의 사항을 확인하거나 거부하는
                표시(예, 마우스 클릭)
              </li>
              <li>
                &quot;서비스&quot;의 이용신청에 관한 확인 또는 &quot;당 사이트&quot;의 확인에 대한
                동의
              </li>
            </ol>
          </li>
        </ol>

        <h2>제5장 기타</h2>

        <h3>제26조(면책조항)</h3>
        <ol>
          <li>
            &quot;당 사이트&quot;는 천재지변 또는 이에 준하는 불가항력으로 인하여
            &quot;서비스&quot;를 제공할 수 없는 경우에는 &quot;서비스&quot; 제공에 관한 책임이
            면제됩니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한
            제3자의 고의적인 서비스 방해가 있는 경우에는 &quot;서비스&quot; 제공에 관한
            책임이 면제됩니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 &quot;이용자&quot;의 귀책사유로 인한 서비스 이용의 장애에
            대하여는 책임을 지지 않습니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 &quot;회원&quot;이 &quot;서비스&quot;와 관련하여 게재한 정보, 자료, 사실의
            신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.
          </li>
          <li>
            &quot;당 사이트&quot;는 &quot;이용자&quot; 상호간 또는 &quot;이용자&quot;와 제3자 간에 &quot;서비스&quot;를
            매개로 하여 발생한 분쟁 등에 대하여 책임을 지지 않습니다.
          </li>
          <li>
            제1호 내지 제2호를 제외한 기타 회사의 고의∙과실이 없는 사유로 인한
            경우에는 &quot;서비스&quot; 제공에 관한 책임이 면제됩니다.
          </li>
        </ol>

        <h3>제27조(분쟁의 해결)</h3>
        <p>
          &quot;당 사이트&quot;는 분쟁이 발생하였을 경우에 &quot;이용자&quot;가 제기하는 정당한
          의견이나 불만을 반영하여 적절하고 신속한 조치를 취합니다. 다만, 신속한
          처리가 곤란한 경우에 &quot;당 사이트&quot;는 &quot;이용자&quot;에게 그 사유와 처리일정을
          통보합니다.
        </p>

        <h3>제28조 (규정의 준용)</h3>
        <p>
          본 약관에 명시되지 않은 사항에 대해서는 관련법령에 의하고, 법에
          명시되지 않은 부분에 대하여는 관습에 의합니다.
        </p>
        <p>이 약관은 2023년 7월 3일부터 적용됩니다.</p>
      </div>
    </div>
  );
}
